TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/)
      - waitForLinkText(destination of the week! The Beach!): "Clickable"
      - clickByLinkText(destination of the week! The Beach!)
    - label: Tela da Viagem do Fim de Semana Praia
      actions:
      - waitForLinkText(home): "Clickable"
      - clickByLinkText(home)
    - label: Tela de Login
      actions:
      - waitForID(email): "Clickable"
      - clickByID(email)
      - waitForID(email): "Clickable"
      - typeByID(email): "GuilhermeoLoko@gmail.com.br"
      - waitForID(password): "Clickable"
      - clickByID(password)
      - waitForID(password): "Clickable"
      - typeSecretByID(password): "159191"
      - waitForCSS(div.checkbox): "Clickable"
      - clickByCSS(div.checkbox)
      - waitForCSS(div.checkbox > label): "Clickable"
      - clickByCSS(div.checkbox > label)
      - waitForCSS(div.checkbox > label): "Clickable"
      - clickByCSS(div.checkbox > label)
      - waitForCSS(button.btn.btn-primary): "Clickable"
      - clickByCSS(button.btn.btn-primary)
    - label: Tento Fazer Login sem Registro Tenho Erro
      actions:
      - waitForLinkText(Register): "Clickable"
      - clickByLinkText(Register)
      - waitForID(company): "Clickable"
      - clickByID(company)
      - waitForID(company): "Clickable"
      - typeByID(company): "asdasd"
      - waitForID(email): "Clickable"
      - clickByID(email)
      - waitForID(email): "Clickable"
      - typeByID(email): "1qdasdasd"
      - waitForID(password): "Clickable"
      - clickByID(password)
      - waitForID(password): "Clickable"
      - typeSecretByID(password): "asdasdasd"
      - waitForID(password-confirm): "Clickable"
      - clickByID(password-confirm)
      - waitForID(password-confirm): "Clickable"
      - typeSecretByID(password-confirm): "asdasdasdasd"
      - waitForCSS(button.btn.btn-primary): "Clickable"
      - clickByCSS(button.btn.btn-primary)
      - 'waitForCSS(div:nth-of-type(3))': "Clickable"
      - 'clickByCSS(div:nth-of-type(3))'
      - waitForID(email): "Clickable"
      - typeByID(email): "Carlos@Gmail.com"
      - waitForCSS(button.btn.btn-primary): "Clickable"
      - clickByCSS(button.btn.btn-primary)
    - label: Tento Registrar e Tambem não consigo
      actions:
      - waitForLinkText(BlazeDemo): "Clickable"
      - clickByLinkText(BlazeDemo)
    - label: Rodando A Escolha de Viagem
      actions:
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - 'waitForCSS(tr:nth-of-type(2) .btn)': "Clickable"
      - 'clickByCSS(tr:nth-of-type(2) .btn)'
      - waitForCSS(div.control-group): "Clickable"
      - clickByCSS(div.control-group)
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "Guilherme Macedo de Lima"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "Av Corifeu de Lima 799"
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "Taboão da Serra"
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - typeByID(state): "São Paulo"
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "06753280"
      - waitForID(cardType): "Clickable"
      - clickByID(cardType)
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "162659169516516951651651"
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "Guilherme ML"
      - waitForCSS(label.checkbox): "Clickable"
      - clickByCSS(label.checkbox)
      - waitForCSS(label.checkbox): "Clickable"
      - clickByCSS(label.checkbox)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
    - label: Após Escolher o Voo que Quero Solicita minhas Informações
      actions:
      - waitForCSS(h1): "Clickable"
      - clickByCSS(h1)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      Sec-Fetch-Site: same-origin
      Sec-Fetch-Mode: navigate
      Sec-Fetch-Dest: document
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/vacation.html
            method: GET
            label: https://blazedemo.com/vacation.html
            think-time: 0ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
      - transaction: Tela da Viagem do Fim de Semana Praia
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/login
            method: GET
            label: https://blazedemo.com/login
            think-time: 41001ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
      - transaction: Tela de Login
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/login
            method: POST
            label: https://blazedemo.com/login
            think-time: 20092ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
            body:
              _token: 28RsWI9PVwRySZkd1kzalsULytGrVOiVnaX8GaGd
              email: GuilhermeoLoko@gmail.com.br
              password: '159191'
              remember: 'on'
      - transaction: Tento Fazer Login sem Registro Tenho Erro
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/login
            method: GET
            label: https://blazedemo.com/login
            think-time: 13477ms
            headers: {}
          - url: https://blazedemo.com/register
            method: GET
            label: https://blazedemo.com/register
            think-time: 2622ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
          - url: https://blazedemo.com/register
            method: POST
            label: https://blazedemo.com/register
            think-time: 19136ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
            body:
              _token: Fld87DQcxGI46VL5OGnMQ3JInG0HS8ypZSjBKLMA
              company: asdasd
              email: Carlos@Gmail.com
              name: '234'
              password: asdasdasd
              password_confirmation: asdasdasdasd
      - transaction: Tento Registrar e Tambem não consigo
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/register
            method: GET
            label: https://blazedemo.com/register
            think-time: 18549ms
            headers: {}
          - url: https://blazedemo.com/
            method: GET
            label: https://blazedemo.com/
            think-time: 1232ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
      - transaction: Rodando A Escolha de Viagem
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 18040ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 69542ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
            body:
              airline: United Airlines
              flight: '234'
              fromPort: Paris
              price: '432.98'
              toPort: Buenos Aires
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 38346ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"19.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0",
                "Google Chrome";v="134.0.6998.88"
              Sec-Fetch-User: '?1'
            body:
              _token: ''
              address: Av Corifeu de Lima 799
              cardType: amex
              city: Taboão da Serra
              creditCardMonth: '11'
              creditCardNumber: '162659169516516951651651'
              creditCardYear: '2017'
              inputName: Guilherme Macedo de Lima
              nameOnCard: Guilherme ML
              rememberMe: 'on'
              state: São Paulo
              zipCode: '06753280'